user/tutorials/sprayA/constant/thermo
N2
{
    specie
    {
        molWeight       28.0134;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           6000;
        Tcommon         1000;
        highCpCoeffs    ( 2.95257637 0.0013969004 -4.92631603e-07 7.86010195e-11 -4.60755204e-15 -923.948688 5.87188762 );
        lowCpCoeffs     ( 3.53100528 -0.000123660988 -5.02999433e-07 2.43530612e-09 -1.40881235e-12 -1046.97628 2.96747038 );
    }
    transport
    {
        As              1.67212e-06;
        Ts              170.672;
    }
    elements
    {
        N               2;
    }
}

O2
{
    specie
    {
        molWeight       31.9988;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           6000;
        Tcommon         1000;
        highCpCoeffs    ( 3.45852381 0.00104045351 -2.79664041e-07 3.11439672e-11 -8.55656058e-16 10222.9063 4.15264119 );
        lowCpCoeffs     ( 3.78535371 -0.0032192854 1.12323443e-05 -1.17254068e-08 4.17659585e-12 10292.2572 3.27320239 );
    }
    transport
    {
        As              1.67212e-06;
        Ts              170.672;
    }
    elements
    {
        O               2;
    }
}

C12H26
{
    specie
    {
        molWeight       170.34102;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           6000;
        Tcommon         1000;
        highCpCoeffs    ( 20.4565203 0.0348575357 -1.09226846e-05 1.67201776e-09 -9.8102485e-14 -32555.6365 -80.4405017 );
        lowCpCoeffs     ( 11.1532994 -0.00949419773 0.000195572075 -2.49753662e-07 9.84877715e-11 -26768.8904 -15.9096837 );
    }
    transport
    {
        As              1.67212e-06;
        Ts              170.672;
    }
    elements
    {
        C               12;
        H               26;
    }
}


H2O
{
    specie
    {
        molWeight       18.0;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           6000;
        Tcommon         1000;
        highCpCoeffs    ( 20.4565203 0.0348575357 -1.09226846e-05 1.67201776e-09 -9.8102485e-14 -32555.6365 -80.4405017 );
        lowCpCoeffs     ( 11.1532994 -0.00949419773 0.000195572075 -2.49753662e-07 9.84877715e-11 -26768.8904 -15.9096837 );
    }
    transport
    {
        As              1.67212e-06;
        Ts              170.672;
    }
    elements
    {
        C               12;
        H               26;
    }
}


CO2
{
    specie
    {
        molWeight       44.01;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           6000;
        Tcommon         1000;
        highCpCoeffs    ( 20.4565203 0.0348575357 -1.09226846e-05 1.67201776e-09 -9.8102485e-14 -32555.6365 -80.4405017 );
        lowCpCoeffs     ( 11.1532994 -0.00949419773 0.000195572075 -2.49753662e-07 9.84877715e-11 -26768.8904 -15.9096837 );
    }
    transport
    {
        As              1.67212e-06;
        Ts              170.672;
    }
    elements
    {
        C               12;
        H               26;
    }
}

CH4
{
    specie
    {
        molWeight       16.0;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           6000;
        Tcommon         1000;
        highCpCoeffs    ( 20.4565203 0.0348575357 -1.09226846e-05 1.67201776e-09 -9.8102485e-14 -32555.6365 -80.4405017 );
        lowCpCoeffs     ( 11.1532994 -0.00949419773 0.000195572075 -2.49753662e-07 9.84877715e-11 -26768.8904 -15.9096837 );
    }
    transport
    {
        As              1.67212e-06;
        Ts              170.672;
    }
    elements
    {
        C               12;
        H               26;
    }
}
