user/tutorials/sprayA/system/fvSchemes_spray
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default         Gauss upwind;//none;

    div(phi,U)      Gauss vanLeer;//upwind;
    div(phid,p)     Gauss vanLeer;//upwind;
    div(phi,K)      Gauss vanLeer;//upwind;//linear;
    div(phi,k)      Gauss vanLeer;//upwind;
    div(phi,epsilon) Gauss vanLeer;//upwind;
    div(U)          Gauss vanLeer;//upwind;//linear;
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
    div(phi,Yi_h)   Gauss vanLeer;//upwind;
}

laplacianSchemes
{
    default         Gauss linear orthogonal;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         orthogonal;
}


// ************************************************************************* //
