user/tutorials/sprayA/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    // inlet patch generation
    // inletWall patch from blockMeshDict
    {
        name    inlet;
        type    faceSet;
        action  new;
        source  patchToFace;
        sourceInfo
        {
            name "walls";
        }
    }
    // cutting volume for inlet
    {
        name    inletCells;
        type    cellSet;
        action  new;
        source  cylinderToCell;
        sourceInfo
        {
            
            p1          (3e-4 0 0);
            p2          (-3e-4 0 0);
            radius      4.5e-5;
        }
    }
    // cutting surfaces for inlet
    {
        name    inletFaces;
        type    faceSet;
        action  new;
        source  cellToFace;
        sourceInfo
        {
            set        inletCells;
            option     all;
        }
    }
    // temporary inletWall patch clone
    {
        name    inletPatch;
        type    faceSet;
        action  new;
        source  faceToFace;
        sourceInfo
        {
            set "inlet";
        }
    }
    // cutting temporary inletWall patch clone
    {
        name    inletPatch;
        type    faceSet;
        action  delete;
        source  faceToFace;
        sourceInfo
        {
            set "inletFaces";
        }
    }
    // cutting final inlet patch
    {
        name    inlet;
        type    faceSet;
        action  delete;
        source  faceToFace;
        sourceInfo
        {
            set "inletPatch";
        }
    }

);

// ************************************************************************* //
